# Creating Connection

In [24]:
import mysql
import mysql.connector
cnx = mysql.connector.connect(host="localhost",port=int(3308),user="root",password="vishal",database='studentinfo')
cursor = cnx.cursor()
print(cursor)
#cnx.close() close the connection

MySQLCursor: (Nothing executed yet)

# Creating Database

In [25]:
cursor = cnx.cursor()
cursor.execute("CREATE DATABASE mydatabase")

# Show Databases

In [26]:
cursor = cnx.cursor()
cursor.execute("SHOW DATABASES")
for x in cursor:
  print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('studentinfo',)
('sys',)
('world',)

# Fetching Data

In [27]:
query = ("select roll_no,name from studentinfo.student")
cursor.execute(query)
for (roll_no,name) in cursor:
    print(roll_no,name)
cursor.close()
cnx.close()

1 akash

In [28]:
cnx = mysql.connector.connect(host="localhost",port=int(3308),user="root",password="vishal",database='studentinfo')
cursor = cnx.cursor()
cursor.execute("CREATE TABLE studentinfo.team1(name varchar(20),location varchar(40))")

In [29]:
insertquery = "INSERT INTO studentinfo.team1 (name,location) VALUE (%s,%s)" 
value = ('Vish','pune')
cursor.execute(insertquery,value)

In [30]:
insertquery = "INSERT INTO studentinfo.team1 (name,location) VALUE (%s,%s)" 
value = ('neha','pune')
cursor.execute(insertquery,value)

In [31]:
insertquery = "INSERT INTO studentinfo.team1 (name,location) VALUE (%s,%s)" 
value = ('rutu','pune')
cursor.execute(insertquery,value)

In [32]:
cursor = cnx.cursor()
cursor.execute("Select * from team1")

In [33]:
cursor.fetchall()

[('Vish', 'pune'), ('neha', 'pune'), ('rutu', 'pune')]

# Multiple Insert

In [34]:
cursor = cnx.cursor()
multiple_insert = "INSERT INTO studentinfo.team1 (name,location) VALUES (%s,%s)" 
values = [('VINOD','Newzland'),('shubham','USA'),('kkp','China'),('RASHMI','Mumbai')]
cursor.executemany(multiple_insert,values)

# Droping the table

In [37]:
#cursor.execute("Drop table studentinfo.team1")

# Fetching 1 and Many Records

In [38]:
cursor.execute("Select * from team1")

In [39]:
cursor.fetchone()

('Vish', 'pune')

In [40]:
print(cursor)

MySQLCursor: Select * from team1

In [44]:
cursor.fetchall()

[('neha', 'pune'),
 ('rutu', 'pune'),
 ('VINOD', 'Newzland'),
 ('shubham', 'USA'),
 ('kkp', 'China'),
 ('RASHMI', 'Mumbai')]

# Delete row from table

In [47]:
sql = "DELETE FROM team1 WHERE name = '%s'" % ('kkp')
# Execute the SQL command
cursor.execute(sql)   
# Commit your changes in the database
cnx.commit()

In [49]:
cursor.execute("Select * from team1")
cursor.fetchall()

[('Vish', 'pune'),
 ('neha', 'pune'),
 ('rutu', 'pune'),
 ('VINOD', 'Newzland'),
 ('shubham', 'USA'),
 ('RASHMI', 'Mumbai')]

# Update location

In [51]:
cursor = cnx.cursor()

sql = "UPDATE team1 SET location = 'Nagpure' WHERE location = 'USA'"

cursor.execute(sql)

cnx.commit()

print(cursor.rowcount, "record(s) affected")

1 record(s) affected

In [52]:
cursor.execute("Select * from team1")
cursor.fetchall()

[('Vish', 'pune'),
 ('neha', 'pune'),
 ('rutu', 'pune'),
 ('VINOD', 'Newzland'),
 ('shubham', 'Nagpure'),
 ('RASHMI', 'Mumbai')]

# Order by

In [54]:
cursor = cnx.cursor()

sql = "SELECT * FROM team1 ORDER BY name DESC"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('Vish', 'pune')
('VINOD', 'Newzland')
('shubham', 'Nagpure')
('rutu', 'pune')
('RASHMI', 'Mumbai')
('neha', 'pune')

In [58]:
cursor = cnx.cursor()

sql = "SELECT * FROM team1 ORDER BY name ASC"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('neha', 'pune')
('RASHMI', 'Mumbai')
('rutu', 'pune')
('shubham', 'Nagpure')
('VINOD', 'Newzland')
('Vish', 'pune')

# Where clause

In [56]:
cursor = cnx.cursor()

sql = "SELECT * FROM team1 WHERE location ='pune'"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('Vish', 'pune')
('neha', 'pune')
('rutu', 'pune')

# Join operations(inner join, right join,left join)

In [59]:
cursor.execute("CREATE TABLE studentinfo.team2(id int,name varchar(20),location varchar(40))")

In [60]:
cursor = cnx.cursor()
multiple_insert = "INSERT INTO studentinfo.team2 (id,name,location) VALUES (%s,%s,%s)" 
values = [(1,'VINOD','pune'),(2,'nanum','nagpur'),(3,'rushi','pune'),(4,'RASHMI','Mumbai'),(5,'Vish','pune')]
cursor.executemany(multiple_insert,values)

In [64]:
cursor.execute("Select * from team1")
cursor.fetchall()

[('Vish', 'pune'),
 ('neha', 'pune'),
 ('rutu', 'pune'),
 ('VINOD', 'Newzland'),
 ('shubham', 'Nagpure'),
 ('RASHMI', 'Mumbai')]

In [61]:
cursor.execute("Select * from team2")
cursor.fetchall()

[(1, 'VINOD', 'pune'),
 (2, 'nanum', 'nagpur'),
 (3, 'rushi', 'pune'),
 (4, 'RASHMI', 'Mumbai'),
 (5, 'Vish', 'pune')]

# INNER JOIN

In [63]:
cursor = cnx.cursor()

sql = "SELECT team1.name,team2.name FROM team1 INNER JOIN team2 ON team1.name = team2.name"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('Vish', 'Vish')
('VINOD', 'VINOD')
('RASHMI', 'RASHMI')

# LEFT JOIN

In [65]:
cursor = cnx.cursor()

sql = "SELECT team1.name,team2.name FROM team1 LEFT JOIN team2 ON team1.name = team2.name"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('Vish', 'Vish')
('neha', None)
('rutu', None)
('VINOD', 'VINOD')
('shubham', None)
('RASHMI', 'RASHMI')

# RIGHT JOIN

In [66]:
cursor = cnx.cursor()

sql = "SELECT team1.name,team2.name FROM team1 RIGHT JOIN team2 ON team1.name = team2.name"

cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('VINOD', 'VINOD')
(None, 'nanum')
(None, 'rushi')
('RASHMI', 'RASHMI')
('Vish', 'Vish')